app/services/reminder.rb

INSERT INTO "reminds" ("user_id", "send_time") VALUES (?, ?)  [["user_id", 34], ["send_time", "2020-11-19 08:12:43.578554"]]
---
  def save_and_sent!
    ActiveRecord::Base.transaction do
      remind.save!

SELECT "reminds".* FROM "reminds" ORDER BY "reminds"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def wait!
    Remind.last.delay(run_at: time).update(status: 'done', send_time: DateTime.now)

INSERT INTO "reminds" ("user_id", "send_time", "status") VALUES (?, ?, ?)  [["user_id", 12], ["send_time", "2020-11-19 02:56:25.750052"], ["status", 1]]
---
  def remind
    Remind.new(
      {
        user_id: @user.id,
        send_time: @user.created_at,
        status: 'wait'
      }
    )