app/services/reminder.rb

SELECT "reminds".* FROM "reminds" WHERE "reminds"."name" = ? LIMIT ?  [["name", "sms_7day"], ["LIMIT", 1]]
---
  def initialize(user:)
    @user = user
    @remind = Remind.find_by(name: 'sms_7day')