app/controllers/reminds_controller.rb

SELECT "reminds".* FROM "reminds"
---
  def index
    @reminds = Remind.all

SELECT "reminds".* FROM "reminds" WHERE "reminds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @remind = Remind.find(params[:id])

INSERT INTO "reminds" ("name", "message_remind", "delay_days") VALUES (?, ?, ?)  [["name", "sa"], ["message_remind", "hi"], ["delay_days", 21]]
---
  def create
    @remind = Remind.new(remind_params)
    if @remind.save

SELECT "reminds".* FROM "reminds" WHERE "reminds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reminds" SET "name" = ?, "message" = ?, "days" = ? WHERE "reminds"."id" = ?  [["name", "sms_7day"], ["message", "Ahoy!!"], ["days", 7], ["id", 1]]
---
  def update
    if Remind.find(params[:id]).update(remind_params)